fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	ВКМ_УправлениеВидимостьюЭлементов();	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементПериодДействияДоговора = Элементы.Добавить("ВКМ_ПериодДействияДоговора", Тип("ПолеФормы"));
	ЭлементПериодДействияДоговора.ПутьКДанным = "Объект.ВКМ_ПериодДействияДоговора";
	ЭлементПериодДействияДоговора.Заголовок = "Действует до :";
	ЭлементПериодДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ЭлементСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	
	ВКМ_УправлениеВидимостьюЭлементов();			
			
КонецПроцедуры

Процедура ВКМ_УправлениеВидимостьюЭлементов()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание  Тогда
		
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_ПериодДействияДоговора.Видимость = Истина;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе 
			
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_ПериодДействияДоговора.Видимость = Ложь;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		ЭтотОбъект.ПодчиненныеЭлементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;
			
КонецПроцедуры
